doc/dos-mitigation.org
#+TITLE: DoS Mitigation in (n+1)sec protocol
* DoS axioms:
** We assume that the joiner cannot deny access for other joiners because of the following:
*** The line in the code which results in dropping other join requests:
           if (action_to_take.action_type == RoomAction::NEW_PRIORITY_SESSION ||
            action_to_take.action_type == RoomAction::PRESUME_HEIR) {
            stale_in_limbo_sessions_presume_heir(action_to_take.bred_session->session_id);
        } // else { //user state in the room

*** The condition that leads to PRESUME_HEIR
    if (everybody_authenticated_and_contributed()) {
        group_dec();
        // first compute the confirmation
        compute_session_confirmation();
        // we need our future ephemeral key to attach to the message
        future_cryptic.init();
        // now send the confirmation message
        Message outboundmessage(&cryptic);

        outboundmessage.create_session_confirmation_msg(
            session_id, hash_to_string_buff(session_confirmation),
            public_key_to_stringbuff(future_cryptic.get_ephemeral_pub_key()));

        outboundmessage.send(room_name, us);

        RoomAction re_limbo_action;

        re_limbo_action.action_type = RoomAction::PRESUME_HEIR;
        re_limbo_action.bred_session = this;

        return StateAndAction(GROUP_KEY_GENERATED, re_limbo_action);
        // if we are joining we don't need to relimbo and the room will
        // ignore the action
    }
 
*** The condition that leads to NEW_PRIORITY_SESSION
   RoomAction Session::shrink(std::string leaving_nick)
   {
    // we are basically building the intention-to-leave message
    // without broadcasting it (because it is not us who intend to do so),
    // so we are making a fake intention-to-leave message without sending it
    RoomAction new_session_action;

    auto leaver = participants.find(leaving_nick);
    if (leaver == participants.end()) {
        logger.warn("participant " + leaving_nick + " is not part of the active session of the room " + room_name +
                    " from which they are trying to leave, already parted?");
    } else if (zombies.find(leaving_nick) != zombies.end()) { // we haven't shrunk and made a session yet
        logger.debug("shrunk session for leaving user " + leaving_nick + " has already been generated. nothing to do",
                     __FUNCTION__, myself.nickname);
    } else { // shrink now
        // if everything is ok, add the leaver to the zombie list and make a
        // session without zombies
        zombies.insert(*leaver);

        // raison_detre.insert(RaisonDEtre(LEAVE, leaver->id));

        Session* new_child_session =
            new Session(PEER, us, room_name, &future_cryptic, future_participants());

        new_session_action.action_type = RoomAction::NEW_PRIORITY_SESSION;
        new_session_action.bred_session = new_child_session;

        // we are as we have farewelled
        // my_state = FAREWELLED; //We shouldn't change here and it is not clear why
        // we need this stage: so as not to accept join? Why? Join will fail by non-confirmation
        // of the leavers
        return new_session_action;
    }

    return c_no_room_action;
}

*** The joiner DOSing
  - As a result, the joiner cannot leave the session before joining, so she cannot
    invoke NEW_PRIORITY_SESSION. 
    - PRESUME_HEIR is only called when group_dec is successful: if the group dec is not correct, then the user will not drop the other sessions. 
    - If the joiner sends a correct message to some users and a bad message to others, she can force some of the participants to drop the session and some not. Therefore, whenever a user is dropping a session, she should announce it if it is because of: 
       - timeout
       - auth error 
       - decryption error
       - confirmation error

       - If any user sends a decryption error or a confirmation error, then all users of the session run the cheater detection algorithm.

    - Badly signed messages are considered just garbage/not sent/not received.
    
    - Scenarios:
      - A malicious joiner sends bad shares.
      - Results in decryption error. This still needs investigation because it could be some insider who did it. Other joiners join as they did before.
      - Some decrypt correctly and some decrypt badly. In this situation, we still run a DoS detection process. If the shares are all signed, then it is on the sender.

    - Dropping by timing:
      - You request drop in the grace period and wait for the period to pass.
      - You accept drop if the grace period has passed.
      - If you received the messages of the party being dropped, you keep them. Drop the 
        dropper.

    - Detection
      1. If it fails due to session confirmation or decryption failure, the user should inform and request for re-session marked with DoS detection.
      2. If it passes the second time, then you can go ahead, taking off the DoS tag.
      3. If it fails again while tagged with DoS detection, everybody signs and sends their new private key with their old ephemeral public key and old established p2p keys.
      4. Detect the cheater. Drop the cheater. Broadcast your proof.
      5. If someone is dropping someone else without proper proof, drop them indicating lack of proof.

    - Remedy:
      1. The user drops the cheaters/DOSers from the new participant list (as they have indicated their intention to leave), and sends a new participant info message for the new message which tells other joiners to try again.
      2. The user drops as many as she needs till she is alone.
      3. When the user drops someone, she doesn't accept them as participants anymore, only as joiners.
      4. Somebody wants to join as a participant but the user expects her as a joiner, so she informs her about that.

*** No joiner is receiving priority before  
**

** If a set of participants cannot reach an agreement, the status quo will remain in place.
** Maliciousness is relative and defined based on the agreeing subgroup. If the transport delivers different payloads for different participants, then those sets of participants cannot reach an agreement.

* DoS goal:
** A set of benign participants where the transport honestly delivers packets between them should be able to form a session.

* List of DoS possibilities
** DoS Maliciousness
  1. Unresponsiveness.
  2. Generating wrong keyshare.
  3. Confirming wrong session.
  4. Asking for people to leave without reason.
** Exception: Authentication discrepancy:
*** If two participants do not agree on authenticating a new joiner, then the protocol halts without consequences because authentication is (1) deniable and (2) inherently a privilege.

