doc/dos-mitigation.tex
% Created 2016-03-11 Fri 23:07
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\date{\today}
\title{DoS Mitigation in (n+1)sec protocol}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.5.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\tableofcontents

\section{DoS axioms:}
\label{sec-1}
\subsection{We assume that the joiner cannot deny access for other joiners because of the following:}
\label{sec-1-1}
\subsubsection{The line in the code which results in dropping other join requests:}
\label{sec-1-1-1}
   if (action$_{\text{to}}$$_{\text{take}}$.action$_{\text{type}}$ \texttt{= RoomAction::NEW\_PRIORITY\_SESSION ||
            action\_to\_take.action\_type =} RoomAction::PRESUME$_{\text{HEIR}}$) \{
    stale$_{\text{in}}$$_{\text{limbo}}$$_{\text{sessions}}$$_{\text{presume}}$$_{\text{heir}}$(action$_{\text{to}}$$_{\text{take}}$.bred$_{\text{session}}$->session$_{\text{id}}$);
\} // else \{ //user state in the room

\subsubsection{The condition that leads to PRESUME$_{\text{HEIR}}$}
\label{sec-1-1-2}
if (everybody$_{\text{authenticated}}$$_{\text{and}}$$_{\text{contributed}}$()) \{
    group$_{\text{dec}}$();
    // first compute the confirmation
    compute$_{\text{session}}$$_{\text{confirmation}}$();
    // we need our future ephemeral key to attach to the message
    future$_{\text{cryptic}}$.init();
    // now send the confirmation message
    Message outboundmessage(\&cryptic);

outboundmessage.create$_{\text{session}}$$_{\text{confirmation}}$$_{\text{msg}}$(
    session$_{\text{id}}$, hash$_{\text{to}}$$_{\text{string}}$$_{\text{buff}}$(session$_{\text{confirmation}}$),
    public$_{\text{key}}$$_{\text{to}}$$_{\text{stringbuff}}$(future$_{\text{cryptic}}$.get$_{\text{ephemeral}}$$_{\text{pub}}$$_{\text{key}}$()));

outboundmessage.send(room$_{\text{name}}$, us);

RoomAction re$_{\text{limbo}}$$_{\text{action}}$;

re$_{\text{limbo}}$$_{\text{action}}$.action$_{\text{type}}$ = RoomAction::PRESUME$_{\text{HEIR}}$;
re$_{\text{limbo}}$$_{\text{action}}$.bred$_{\text{session}}$ = this;

    return StateAndAction(GROUP$_{\text{KEY}}$$_{\text{GENERATED}}$, re$_{\text{limbo}}$$_{\text{action}}$);
    \emph{/ if we are joining we don't need to relimbo and the room will
    /} ignore the action
\}

\subsubsection{The condition that leads to NEW$_{\text{PRIORITY}}$$_{\text{SESSION}}$}
\label{sec-1-1-3}
RoomAction Session::shrink(std::string leaving$_{\text{nick}}$)
\{
 \emph{/ we are basically building the intention-to-leave message
 /} without broadcasting it (because it is not us who intend to do so),
 // so we are making a fake intention-to-leave message without sending it
 RoomAction new$_{\text{session}}$$_{\text{action}}$;

auto leaver = participants.find(leaving$_{\text{nick}}$);
if (leaver == participants.end()) \{
    logger.warn("participant " + leaving$_{\text{nick}}$ + " is not part of the active session of the room " + room$_{\text{name}}$ +
                " from which they are trying to leave, already parted?");
\} else if (zombies.find(leaving$_{\text{nick}}$) != zombies.end()) \{ // we haven't shrunk and made a session yet
    logger.debug("shrunk session for leaving user " + leaving$_{\text{nick}}$ + " has already been generated. nothing to do",
                 \uline{\uline{FUNCTION}}, myself.nickname);
\} else \{ \emph{/ shrink now
    /} if everything is ok, add the leaver to the zombie list and make a
    // session without zombies
    zombies.insert(*leaver);

// raison$_{\text{detre}}$.insert(RaisonDEtre(LEAVE, leaver->id));

Session* new$_{\text{child}}$$_{\text{session}}$ =
    new Session(PEER, us, room$_{\text{name}}$, \&future$_{\text{cryptic}}$, future$_{\text{participants}}$());

new$_{\text{session}}$$_{\text{action}}$.action$_{\text{type}}$ = RoomAction::NEW$_{\text{PRIORITY}}$$_{\text{SESSION}}$;
new$_{\text{session}}$$_{\text{action}}$.bred$_{\text{session}}$ = new$_{\text{child}}$$_{\text{session}}$;

    \emph{/ we are as we have farewelled
    /} my$_{\text{state}}$ = FAREWELLED; \emph{/We shouldn't change here and it is not clear why
    /} we need this stage: so as not to accept join? Why? Join will fail by non-confirmation
    // of the leavers
    return new$_{\text{session}}$$_{\text{action}}$;
\}

    return c$_{\text{no}}$$_{\text{room}}$$_{\text{action}}$;
\}

\subsubsection{The joiner DOSing}
\label{sec-1-1-4}
\begin{itemize}
\item As a result, the joiner cannot leave the session before joining, so she cannot
invoke NEW$_{\text{PRIORITY}}$$_{\text{SESSION}}$. 
\begin{itemize}
\item PRESUME$_{\text{HEIR}}$ is only called when group$_{\text{dec}}$ is successful: if the group dec is not correct, then the user will not drop the other sessions.
\item If the joiner sends a correct message to some users and a bad message to others, she can force some of the participants to drop the session and some not. Therefore, whenever a user is dropping a session, she should announce it if it is because of: 
\begin{itemize}
\item timeout
\item auth error
\item decryption error
\item confirmation error

\item If any user sends a decryption error or a confirmation error, then all users of the session run the cheater detection algorithm.
\end{itemize}

\item Badly signed messages are considered just garbage/not sent/not received.

\item Scenarios:
\begin{itemize}
\item A malicious joiner sends bad shares.
\item Results in decryption error. This still needs investigation because it could be some insider who did it. Other joiners join as they did before.
\item Some decrypt correctly and some decrypt badly. In this situation, we still run a DoS detection process. If the shares are all signed, then it is on the sender.
\end{itemize}

\item Dropping by timing:
\begin{itemize}
\item You request drop in the grace period and wait for the period to pass.
\item You accept drop if the grace period has passed.
\item If you received the messages of the party being dropped, you keep them. Drop the 
dropper.
\end{itemize}

\item Detection
\begin{enumerate}
\item If it fails due to session confirmation or decryption failure, the user should inform and request for re-session marked with DoS detection.
\item If it passes the second time, then you can go ahead, taking off the DoS tag.
\item If it fails again while tagged with DoS detection, everybody signs and sends their new private key with their old ephemeral public key and old established p2p keys.
\item Detect the cheater. Drop the cheater. Broadcast your proof.
\item If someone is dropping someone else without proper proof, drop them indicating lack of proof.
\end{enumerate}

\item Remedy:
\begin{enumerate}
\item The user drops the cheaters/DOSers from the new participant list (as they have indicated their intention to leave), and sends a new participant info message for the new message which tells other joiners to try again.
\item The user drops as many as she needs till she is alone.
\item When the user drops someone, she doesn't accept them as participants anymore, only as joiners.
\item Somebody wants to join as a participant but the user expects her as a joiner, so she informs her about that.
\end{enumerate}
\end{itemize}
\end{itemize}

\subsubsection{No joiner is receiving priority before}
\label{sec-1-1-5}
**

\subsection{If a set of participants cannot reach an agreement, the status quo will remain in place.}
\label{sec-1-2}
\subsection{Maliciousness is relative and defined based on the agreeing subgroup. If the transport delivers different payloads for different participants, then those sets of participants cannot reach an agreement.}
\label{sec-1-3}

\section{DoS goal:}
\label{sec-2}
\subsection{A set of benign participants where the transport honestly delivers packets between them should be able to form a session.}
\label{sec-2-1}

\section{List of DoS possibilities}
\label{sec-3}
\subsection{DoS Maliciousness}
\label{sec-3-1}
\begin{enumerate}
\item Unresponsiveness.
\item Generating wrong keyshare.
\item Confirming wrong session.
\item Asking for people to leave without reason.
\end{enumerate}
\subsection{Exception: Authentication discrepancy:}
\label{sec-3-2}
\subsubsection{If two participants do not agree on authenticating a new joiner, then the protocol halts without consequences because authentication is (1) deniable and (2) inherently a privilege.}
\label{sec-3-2-1}
