doc/dos-mitigation.org
* How to detect
  - When a participant concludes that another participant is malicious
    because of one of the above reasons, she request that participant to be 
    kicked out of the participant list, and includes the reason for the kick.
  - How to detect DoS:
    - Time dependent: allow double amount of timeout to react, but accept any reaction after the timeout period.
    - Generating wrong keyshare or confirmation share:
      - Generate a new share (not to disclose the previous secret).
      - In case of failure, encrypt the new shares using AES-GCM with the old p2p key and send it to everybody.

* How to react after detection
  - If DoS happens during a join process, 
       If it is the joiner who is malicious:
          The maliciousness is happening in session confirmation phase:
          - just drop the session in limbo. Send re-join message with participant info without DoSer.
          - The maliciousness is happening before sending session confirmation phase. Just drop the joining session.

       A current participant is malicious:
          - send a kick request which generates a session confirmation that helps the joiner.

  - If DoS happens during leave process:
       Send a kick request for the malicious participant.

  - If DoS happens during re-session.
       Send a kick request for the malicious participant.
  
  - Authentication failure is a reason for barring join but not DoS.

  - When someone gets kicked out due to DoS reasons, she should become the 
    last person to join after all the other joiners already in line.

* Concerns:
  - Timing problems. There should be an acceptable delay. The messages arrived within an 
  acceptable delay period should be ordered in their hash order. But we 
  assume global ordering on messages for now.

  - Multiple sessions in the same room. This is a natural consequence of the end-to-end protocol, as a different subgroup might have agreed on different views. This is not a problem with current participants, as they are ignoring the session id for which they do not have an established session.
  - For a joining participant, the UI will present a choice of sessions and participants which the joiner can choose to join. 
  - For the sake of simplicity, we assume that each room is divided into mutually exclusive sessions. 

* Proof of DoS protection
  - Theorem: Suppose $U_1,...,U_n$ are sets of participants. $I_h \cap I_m = \{1,...,n\}$.
  where $I_o$ is the set of honest and $I_m$ the set of malcious participants, then, after running the above algorithm, each participant gets a list of $plist_i$. If the transport is honestly and consistently delivering messages in timely manner, then for $i,j \in I_h$  
  we have $U_i \in plist_j$.

  Proof: TBD.
  
* New Algorithm:
  * Badly signed messages are dropped and treated as undelivered.
  * If someone fails to contribute any message we are waiting for, we wait for the grace_period
    and then we just assume they left.
  * If key generation or confirmation fails, then we need to re-session with the session 
    tagged as DoS detection. Users only can do this by sharing the evidence of cheating.
  * If we fail key generation or confirmation with Dos detection tag, then we publish
    all private key encrypted by p2p keys signed by non-DoS-tagged authenticated
    private key. The cheater will be detected and kicked out.
  * If U_i kicks U_j out (that is starting session S while U_j is not in the 
    new session) without cheating evidence signed by alleged cheater U_j, then U_k starts a session without
    U_i in it but U_j in it. That could be because U_k has not received U_j's intention-to-leave
    message.

** Sub protocol for unresponsiveness on join or re-session or any other part of the key agreement protocol.
   If U_i fails to reply, U_j sends a kick request (for failure to reply) after the grace period has passed.
   Other participants either should agree with the kick and respond by participant-info message or re-broadcast the failed message (if they have received it despite the fact that U_j has not). When 
   you get the message for failed delivery, you *have to* agree or rebroadcast. If you fail to do so, you will be dropped as well.
   - The main idea is to have two timers:
     A replies before timer 1 ends, B asks to kick out A=> kickout B.
     A replies after timer 1 but before timer 2 ends, B asks to kick out A => kickout A.
     A replies after timer 2 but B does not ask to kickout A => ask to kickout A.

 -- Current users start a timer as soon as they get a join request for 
   all users in the room to respond with authentication. 

   Note: Authentication failed should be an acceptable response.

   -- If the timer times out, they mark the user as unresponsive and start
   another timer to report the user as unresponsive.

   -- If they receive the message before the timer times out,
      and no other user requests the user to leave, they continue with
      the session establishment.

   -- If somebody requests a new session without the user, they accept
      the request and can drop the session.

   -- If they don't receive the message before the second timer times
      out, they request a session without the unresponsive users.

   -- If they receive a session shrink but the kicked-out user
      has replied in time for the first timer, they drop the requesting
      user. (We should because the receiving user and the requesting user have different views of the room.)
   
   The users will play the second round, set up timers and follow the same 
   rules.

-- Conflict of circles:
   Obviously there will be a circle conflict because:

   A thinks B is in and C is not. (A,B) => A eventually doesn't receive a response from B and drops B.
   B thinks C is in and A is not. (B,C) =>  B doesn't receive a response from C and drops C.
   C thinks A, B and C are in. (A,B,C) => C doesn't receive a response from A and B and drops both of them.

   - In the end only users whose views are completely in agreement will stay in the same session. The room might be
     divided into different mutually exclusive sessions. (View agreement is an equivalence relationship.) 
     The new joiner will be presented the option of choosing which session to join.

So it is obvious that we should treat cheating and transport problems separately, because the latter are provable.

Planned but not to be implemented in this phase: in particular, if A decides that C is unresponsive while C is responsive, then
B can relay C info signed by C to A.

When B receives a DoS re-session request from A to drop C: either B agrees with A on the reason of dropping C or she doesn't. If yes, she continues with the kick protocol on C. If no, then B's view does not agree with A's view, and therefore they cannot be in the same session. As such, B sends a kick request for A, attaching A's reason, and all other participants whose view agrees with B drop A and start a new session.

