doc/dos-mitigation.tex

\section{How to detect}
\label{sec-4}
\begin{itemize}
\item When a participant concludes that another participant is malicious
because of one of the above reasons, she request that participant to be 
kicked out of the participant list, and includes the reason for the kick.
\item How to detect DoS:
\begin{itemize}
\item Time dependent: allow double amount of timeout to react, but accept any reaction after the timeout period.
\item Generating wrong keyshare or confirmation share:
\begin{itemize}
\item Generate a new share (not to disclose the previous secret).
\item In case of failure, encrypt the new shares using AES-GCM with the old p2p key and send it to everybody.
\end{itemize}
\end{itemize}
\end{itemize}

\section{How to react after detection}
\label{sec-5}
\begin{itemize}
\item If DoS happens during a join process, 
If it is the joiner who is malicious:
   The maliciousness is happening in session confirmation phase:
\begin{itemize}
\item just drop the session in limbo. Send re-join message with participant info without DoSer.
\item The maliciousness is happening before sending session confirmation phase. Just drop the joining session.
\end{itemize}
A current participant is malicious:
\begin{itemize}
\item send a kick request which generates a session confirmation that helps the joiner to know that a new session is generated.
\end{itemize}

\item If DoS happens during leave process:
Send a kick request for the malicious participant.

\item If DoS happens during re-session.
Send a kick request for the malicious participant.

\item Authentication failure is a reason for barring join but not DoS.

\item When someone gets kicked out due to DoS reasons, she should become the 
last person to join after all the other joiners already in line.
\end{itemize}

\section{Concerns:}
\label{sec-6}
\begin{itemize}
\item Timing problems. There should be an acceptable delay. The messages arrived within an
\end{itemize}
acceptable delay period should be ordered in their hash order. But we 
assume global ordering on messages for now.

\begin{itemize}
\item Multiple sessions in the same room. This is a natural consequence of the end-to-end protocol, as a different subgroup might have agreed on different views. This is not a problem with current participants, as they are ignoring the session id for which they do not have an established session.
\item For a joining participant, the UI will present a choice of sessions and participants which the joiner can choose to join.
\item For the sake of simplicity, we assume that each room is divided into mutually exclusive sessions.
\end{itemize}

\section{Proof of DoS protection}
\label{sec-7}
\begin{itemize}
\item Theorem: Suppose $U_1,...,U_n$ are sets of participants. $I_h \cap I_m = \{1,...,n\}$.
\end{itemize}
where $I_o$ is the set of honest and $I_m$ the set of malcious participants, then, after running the above algorithm, each participant gets a list of $plist_i$. If the transport is honestly and consistently delivering messages in timely manner, then for $i,j \in I_h$  
we have $U_i \in plist_j$.

Proof: TBD.

\section{New Algorithm:}
\label{sec-8}
\begin{itemize}
\item Badly signed messages are dropped and treated as undelivered.
\item If someone fails to contribute any message we are waiting for, we wait for the grace$_{\text{period}}$
    and then we just assume they left.
\item If key generation or confirmation fails, then we need to re-session with the session 
tagged as DoS detection. Users only can do this by sharing the evidence of cheating.
\item If we fail key generation or confirmation with Dos detection tag, then we publish
all private key encrypted by p2p keys signed by non-DoS-tagged authenticated
private key. The cheater will be detected and kicked out.
\item If U$_{\text{i}}$ kicks U$_{\text{j}}$ out (that is starting session S while U$_{\text{j}}$ is not in the 
new session) without cheating evidence signed by alleged cheater U$_{\text{j}}$, then U$_{\text{k}}$ simply ignore the request 
for the new session.
\end{itemize}

\subsection{Sub protocol for unresponsiveness on join or re-session or any other part of the key agreement protocol.}
\label{sec-8-1}
If U$_{\text{i}}$ fails to reply, U$_{\text{j}}$ sends a kick request (for failure to reply) after the grace period has passed.
Other participants either should agree with the kick and respond by participant-info message or re-broadcast the failed message (if they have received it despite the fact that U$_{\text{j}}$ has not). When 
you get the message for failed delivery, you \textbf{have to} agree or rebroadcast. If you fail to do so, you will be dropped as well.

\begin{itemize}
\item The main idea is to have two timers:
A replies before timer 1 ends, B asks to kick out A=> kickout B.
A replies after timer 1 but before timer 2 ends, B asks to kick out A => kickout A.
A replies after timer 2 but B does not ask to kickout A => ask to kickout A.
\end{itemize}

-- Current users start a timer as soon as they get a join request for 
all users in the room to respond with authentication.

Note: Authentication failed should be an acceptable response.

-- If the timer times out, they mark the user as unresponsive and start
another timer to report the user as unresponsive.

-- If they receive the message before the timer times out,
   and no other user requests the user to leave, they continue with
   the session establishment.

-- If somebody requests a new session without the user, they accept
   the request and can drop the session.

-- If they don't receive the message before the second timer times
   out, they request a session without the unresponsive users.

-- If they receive a session shrink but the kicked-out user
   has replied in time for the first timer, they drop the requesting
   user. (We should because the receiving user and the requesting user have different views of the room.)

The users will play the second round, set up timers and follow the same 
rules.

-- Conflict of circles:
   Obviously there will be a circle conflict because:

A thinks B is in and C is not. (A,B) => A eventually doesn't receive a response from B and drops B.
B thinks C is in and A is not. (B,C) =>  B doesn't receive a response from C and drops C.
C thinks A, B and C are in. (A,B,C) => C doesn't receive a response from A and B and drops both of them.

\begin{itemize}
\item In the end only users whose views are completely in agreement will stay in the same session. The room might be
divided into different mutually exclusive sessions. (View agreement is an equivalence relationship.) 
The new joiner will be presented the option of choosing which session to join.
\end{itemize}

So it is obvious that we should treat cheating and transport problems separately, because the latter are provable.

in particular, if A decides that C is unresponsive while C is responsive, then B can relay C info signed by C to A.

When B receives a DoS re-session request from A to drop C: either B agrees with A on the reason of dropping C or she doesn't. If yes, she continues with the kick protocol on C. If no, B re-send the missing info to A in hope of reaching agreement if A doesn't reply to requested info in timely manner, then B's view does not agree with A's view, and therefore they cannot be in the same session. As such, B sends a kick request for A and all other participants whose view agrees with B drop A and start a new session.
