doc/dos-mitigation.org
*** Delivery failure/Transport delay recovery.
- The protocol agrees on INTERACTIVE_GRACE_PERIOD.
- If U_i expects a message from U_j to establish a session and she does not receive it in INTERACTIVE_GRACE_PERIOD as of the end of the last round, then U_i starts new_session(kick_out U_i, reason: U_i fails message type x from session sid).
- If U_k receives a kick message, they either have received the failed delivery message or they have not: if they have, they resend the message to s'id, message type x from sid by U_j (encrypt or not?) and do not follow up with the new
  session.
- If U_i is the only member of the session and there are more participants in the room, U_i will rejoin the room.

** Sub protocol for generating wrong keyshare or confirming wrong session.

   The protocol general rule:

   -- If key recovery or confirmation fails, then the key agreement protocol runs again with new ephemeral keys. If it fails, then the new keys and proof of cheating are published. A new session starts when the cheater has been kicked out.

-- If someone fails to reply, then run sub-protocol for unresponsive user.

The failed message has the share for the new subgroup, so finally the responsive 
parties will make a successful subgroup.

So we break the protocol into sections:

*** Cheater detection protocol:

   If the key fails to recover or the session confirmation does not match, then a special session with new ephemeral keys will be distributed and session establishment will be attempted. If the cheater detection session fails 
at the same stages, then the participants will reveal their private key signed by their old key and the cheater will be detected and kicked out.

- U_i fails at key recovery or conf_j!= conf_i. Request a cheater detection session, with reason. (Reason is the set of signed shares which does not satisfy the system or the confirmation which does not match the deduced key.)
- U_j receives a request for cheater detection and evaluates the reason. If it is legitimate, a cheater detection session starts.
- If the cheater detection succeeds, it becomes the main session. 
- If the cheater detection session fails, private keys signed by old private keys are published.
- Detect cheater and kick them out with proof.
- Do not join sessions which you do not agree with on the view.
 
