doc/dos-mitigation.tex

\subsubsection{Delivery failure/Transport delay recovery.}
\label{sec-8-1-1}
\begin{itemize}
\item The protocol agrees on INTERACTIVE$_{\text{GRACE}}$$_{\text{PERIOD}}$.
\item If U$_{\text{i}}$ expects a message from U$_{\text{j}}$ to establish a session and she does not receive it in INTERACTIVE$_{\text{GRACE}}$$_{\text{PERIOD}}$ as of the end of the last round, then U$_{\text{i}}$ starts new$_{\text{session}}$(kick$_{\text{out}}$ U$_{\text{i}}$, reason: U$_{\text{i}}$ fails message type x from session sid).
\item If U$_{\text{k}}$ receives a kick message, they either have received the failed delivery message or they have not: if they have, they resend the message to s'id, message type x from sid by U$_{\text{j}}$ (encrypt or not?) and do not follow up with the new
session.
\item If U$_{\text{i}}$ is the only member of the session and there are more participants in the room, U$_{\text{i}}$ will rejoin the room.
\end{itemize}

\subsection{Sub protocol for generating wrong keyshare or confirming wrong session.}
\label{sec-8-2}

The protocol general rule:

-- If key recovery or confirmation fails, then the key agreement protocol runs again with new ephemeral keys. If it fails, then the new keys and proof of cheating are published. A new session starts when the cheater has been kicked out.

-- If someone fails to reply, then run sub-protocol for unresponsive user.

The failed message has the share for the new subgroup, so finally the responsive 
parties will make a successful subgroup.

So we break the protocol into sections:

\subsubsection{Cheater detection protocol:}
\label{sec-8-2-1}

   If the key fails to recover or the session confirmation does not match, then a special session with new ephemeral keys will be distributed and session establishment will be attempted. If the cheater detection session fails 
at the same stages, then the participants will reveal their private key signed by their old key and the cheater will be detected and kicked out.

\begin{itemize}
\item U$_{\text{i}}$ fails at key recovery or conf$_{\text{j}}$!= conf$_{\text{i}}$. Request a cheater detection session, with reason. (Reason is the set of signed shares which does not satisfy the system or the confirmation which does not match the deduced key.)
\item U$_{\text{j}}$ receives a request for cheater detection and evaluates the reason. If it is legitimate, a cheater detection session starts.
\item If the cheater detection succeeds, it becomes the main session.
\item If the cheater detection session fails, private keys signed by old private keys are published.
\item Detect cheater and kick them out with proof.
\item Do not join sessions which you do not agree with on the view.
\end{itemize}
% Emacs 24.5.1 (Org mode 8.2.10)
\end{document}
